//--------------------------------------------------------------------
// inform.mq4 
// 
//--------------------------------------------------------------------
#property indicator_separate_window    // Индик. рисуется в основном окне
//--------------------------------------------------------------------
int init()                          // Специальная функция init()
  {
   return;                          // Выход из спец. ф-ии init()
  }
//--------------------------------------------------------------------
int start()                         // Специальная функция start()
  {
                                    // Специальная функция start()
  
  Comment ("Hello_Roman", Bars);
  


//--------------------------------------------------------------------
   return;                          // Выход из спец. ф-ии start()
  }
//--------------------------------------------------------------------